import React from 'react'

export default function() {
  return (
    <>
      <h2 className="h2ar title"> المفعول المُطْلَق </h2>

      <div className="desc">
        <b> Абсолютное дополнение </b> (المفعول المطلق) называется так как не обусловлено предлогом как другие. Приходит масдаром в
        винительном падеже третьим по счёту, после спряженного (в прошедшем и настоящем временах ) глагола. Приходит
        <b> для усиления значения глагола, для пояснения </b>, а также для <b> указания на количество </b> раз выполнения действия
      </div>
    </>
  )
}
