export default [
  {
    id: 1,
    name: 'الله',
    translate: 'Аллах, Бог, Единый Бог',
    transliteration: 'Алла́х',
    desc:
      'Тот, Кто обладает божественностью и Тот, кто имеет права на то, чтобы Ему поклонялись все. Он есть Бог, Который заслуживает покорность и смирение от нас. Все виды поклонения могут быть адресованы только Ему. Это самое великое имя Аллаха, указывающее на Его божественную сущность. Это имя объемлет все 99 прекрасных имен Аллаха, является особым именем высочайшей сущности Всевышнего. Этим именем не нарекают больше никого',
    mention: 'Имя "Аллах" упоминается в Священном Коране 2697 раз',
  },
  {
    id: 2,
    name: 'الرحمن',
    translate: 'Милостивый, Сострадательный',
    transliteration: 'Ар-Рахма́н',
    desc:
      'Обладающий широчайшей милостью и благами, Милостивый на этом свете ко всем Своим созданиям. Он, который дает благословения и успех всему сущему не делая различия. И к тем, кто достоин милости, и к тем, кто не достоин ее, то есть к верующим и неверующим, мусульманам и немусульманам. Этим именем также не нарекают больше никого',
    mention:
      '56 раз и наиболее часто в 19-й суре (1:3; 2:163; 6:133, 147; 13:30; 17:110; 18:58; 19:18, 19, 26, 44, 45, 58, 61, 69, 75, 78, 85, 87, 88, 91, 92, 93, 96; 20:5, 90, 108, 109; 21:26, 36, 42, 112; 25:26, 59, 60; 26:5; 59:22; и т. д.)',
  },
  {
    id: 3,
    name: 'الرحيم',
    translate: 'Милосердный',
    transliteration: 'Ар-Рахи́м',
    desc:
      'Проявляющий всегда милость, Обладающий бесконечной милостью. Он, который дает благословения и успех, особенно тем, кто использует эти дары так, как сказал Аллах. Проявляющий на том свете милость только к уверовавшим, покорным рабам. Это имя указывает на особую милость Господа к верующим. Он проявил к ним великую милость: во-первых, когда сотворил их; во-вторых, когда наставил на прямой путь и даровал веру; в-третьих, когда осчастливит их в последней жизни',
    mention:
      'Упоминается в Коране: 114 раз по отношению к Аллаху. Часто встречается вместе с именем Аль-Рахман (1:1, 3; 2:37, 54, 128, 160, 163; 3:31; 4:100; 5:3; 5:98; 9:104, 118; 10:107; 11:41; 12:53, 64, 98; 15:49; 19:61; 20:108; 21:83, 112; 26:9, 104, 122, 140, 159, 17, 191, 217; 27:30; 78:38; и т. д.)',
  },
  {
    id: 4,
    name: 'الملك',
    translate: 'Властелин, Царь',
    transliteration: 'Аль-Ма́лик',
    desc:
      'Здесь означает царя царей, абсолютного властелина, заботливо руководящего своими последователями. Властитель всего сущего, Владыка Дня Суда. Аллаh абсолютно не нуждается ни в одном из Своих творений, в то время как все они нуждаются в Нём и находятся в Его власти',
    mention:
      'Это имя встречается в Коране в трёх лингвистических формах: аль-Малик (встречается пять раз), аль-Маалик (встречается два раза, см. Малик Аль-Мульк) и аль-Малиик (встречается один раз). (20:114) (23:116) (59:23) (62:1) (114:2)',
  },
  {
    id: 5,
    name: 'القدوس',
    transliteration: 'Аль-Кудду́с',
    translate: 'Святой',
    mention: 'аль-Бакара 2:255; Фатир 35:41; аль-Хашр 59:23; аль-Джумуа',
    desc:
      'Он Аллах Чистый от недостатков, от виновности, от всего недостойного. Он, который свободен от заблуждения, свободен от беспомощности и какого-либо порока. Недоступный для интеллекта творений и Чистый от того, что может вообразить человек. Далекий от всех качеств, которые могут быть постигнуты чувствами человека либо представлены в нашем воображении и наших мыслях, а тем более, - Далекий от всех пороков и недостатков. Он превыше того, чтобы иметь подобных Себе, равных Себе или сходных с Собой',
  },
  {
    id: 6,
    name: 'السلام',
    transliteration: 'Ас-Саля́м',
    translate: 'Пречистый, Дарующий мир и благополучие',
    mention:
      'ан-Нахль 16:96,97; аль-Фуркан 25:75; Каф 50:31—35; аль-Хашр 59:23',
    desc:
      'Всё благополучие, которое получает раб и остальные творения, исходит от Него',
  },
  {
    id: 7,
    name: 'المؤمن',
    transliteration: 'Аль-Му`мин',
    translate:
      'Оберегающий, Дарующий безопасность, Дающий Веру, Проводник Веры, Гарантирующий защиту',
    mention:
      'ат-Тауба 9:25—27, 40; аль-Хиджр 15:45—48; аль-Ахкаф 46:26; аль-Хашр 59:23',
    desc:
      'Он, который вселяет веру в сердца своих слуг, поддерживая тех, кто ищет спасения в Нем. Он и дает им спокойствие, Верный договору со Своими рабами, Спасающий от мучений Своих верных рабов. Тот, от Кого исходят безопасность и спокойствие посредством указания Им на средства их достижения и преграждения Им путей страха и вреда. Только Он дарует безопасность, и спокойствие наступает только по Его милости. Он даровал нам органы чувств, являющиеся средствами для нашего благополучия, указал нам путь к нашему спасению, даровал лекарства для нашего исцеления, еду и питье для нашего существования. И уверовали мы в Него также по Его милости, ибо только Он хранит безопасность всех творений, и все они надеются на Его помощь и защиту.',
  },
  {
    id: 8,
    name: 'المهيمن',
    transliteration: 'Аль-Мухе́ймин',
    translate: 'Хранитель, Попечитель, Проводник, Спаситель',
    mention: 'аль-Хашр 59:23',
    desc:
      'Он, который охраняет и защищает все сущее. Тот, Кто оберегает, владеет, управляет и наблюдает за деяниями, жизнью и пропитанием каждого из всех Своих созданий - малых и больших, великих и ничтожных',
  },
  {
    id: 9,
    name: 'العزيز',
    transliteration: 'Аль-`Ази́з',
    translate: 'Могущественный, Всемогущий, Победитель',
    mention:
      '2:209, 220, 228, 240; 3:4, 6, 18, 62, 126; 4:56, 158, 165; 5:38, 118; 6:96; 9:40, 71; 11:66; 14:47; 16:60; 22:40, 74; 26:9, 104, 122, 140, 159, 175, 191; 27:78; 29:26, 42; 38:9, 66; 39:5; 48:7; 54:42; 57:1; 58:21; 59:1, 23-24',
    desc:
      'Тот, у Кого особое величие, Непобедимый, Сильнейший, Одерживающий победу над всеми. Величайший; существование сходное с его существованием абсолютно невозможно. Всевышний Аллах - Один, у Него нет сотоварищей, и нужда Его творений в Нем огромна. Ни один из нас не в состоянии обойтись без Него',
  },
  {
    id: 10,
    name: 'الجبار',
    transliteration: 'Аль-Джабба́р',
    translate: 'Подчиняющий, Непреодолимый',
    mention: 'Аль-Хашр 59:23, Аль-Калям 68:19,20, Аш-Шуара 26:33',
    desc:
      'Он Тот , воле Которого подчинены абсолютно все творения, Который может принудить, Он, который восстанавливает все испорченное, завершает все незавершенное и кто обладает возможностью силой заставить людей сделать все, что Он пожелает. Традиционно перевод этого имени с арабского связан с аспектом силы, наличием возможности подчинять. В английских переводах принято использовать термин The Despot, чтобы подчеркнуть мысль о том, что никто не может контролировать Бога, и напротив, Аллах имеет силу принуждения, в частности, принуждения следовать тем или иным путём. Так как следовать Аллаху является наилучшим выбором, подчеркивается благо для человека, связанное с этим качеством Бога. Второе толкование связано со словом jabbarah, которое обычно переводится как "слишком высоко, чтобы быть достигнутым". Отсюда выводится, что Аллах выше чем кто бы то ни был',
  },
  {
    id: 11,
    name: 'المتكبر',
    transliteration: 'Аль-Мутакаббир',
    translate: 'Величественный, Превосходящий',
    mention: '2:260; 7:143; 59:23',
    desc:
      'Он Всевышний, Превосходящий все творения; Единственный Обладатель Истинного Величия, Который показывает Свое величие в каждой вещи и во всех случаях. Превосходящий все творения; Тот, качества которого выше качеств творений, чист от качеств творений; единственный обладатель истинного величия; Тот, Кто находит все свои создания ничтожными по сравнению со своей сущностью, ибо гордости не достоин никто, кроме Него. Его гордость проявляется в том, что он не позволяет никому претендовать на сотворение и оспаривать его повеления, власть и волеизъявление. Он сокрушает всех, высокомерно относящихся к нему и его созданиям. Человек, познавший это имя Аллаха, не проявляет жестокости и высокомерия к созданиям Аллаха, ибо жестокость — это насилие и несправедливость, а высокомерие — это самовозвеличивание, презрение к другим и посягательство на их права. Жестокость не относится к качествам праведных рабов Аллаха. Они обязаны подчиняться и покоряться своему властителю',
  },
  {
    id: 12,
    name: 'الخالق',
    transliteration: 'Аль-Халик',
    translate: 'Творец',
    mention: '6:101-102; 13:16; 24:45; 39:62; 40:62; 41:21; 59:24',
    desc:
      'Тот, кто творит по-настоящему, без примера и прообраза и определяет судьбу для созданий; Тот, Кто создаёт, что хочет, из ничего; тот, Кто создал мастеров и их мастерство, квалификацию; Тот, Кто предопределил меру всех созданий ещё до их существования и наделил их качествами, необходимыми для существования',
  },
  {
    id: 13,
    name: 'البارئ',
    transliteration: 'Аль-Бари',
    translate: 'Развивающий, Совершенствующий, Создатель. (Строитель)',
    mention: '59:24',
    desc:
      'Тот, Кто по Своему могуществу сотворил всё сущее; Он — Творец, Который создал всё из небытия по Своему предопределению. Для этого Ему не надо прилагать каких-либо усилий; Он говорит чему-либо: «Будь!» и оно сбывается. Познавший это имя Всевышнего не поклоняется никому, кроме своего Создателя, обращается только к Нему, ищет помощи только у Него и просит то, в чём нуждается, только у Него',
  },
  {
    id: 14,
    name: 'المصور',
    transliteration: 'Аль-Мусаввир',
    translate: 'Формирующий (Скульптор), Созидающий',
    mention: '20:50, 25:2, 59:24, 64:3',
    desc:
      'Тот, Кто придаёт формы и образы творениям; Тот, Кто дал каждому творению свою неповторимую, отличную от других таких же творений форму, вид, рисунок',
  },
  {
    id: 15,
    name: 'الغفار',
    transliteration: 'Аль-Гаффар',
    translate: 'Прощающий',
    mention: '20:82, 38:66, 39:5, 40:42, 71:10',
    desc:
      'Он, который все прощает и является Единственным Прощающим. Он обещал простить грехи тем , кто обращается к Нему, искренне каясь о совершенном. Тот, кто является утаивающим прегрешения творений, прощающим и на этом и на том свете; Тот, кто делает явными прекрасные черты своих рабов и покрывает их недостатки. Он скрывает их в мирской жизни и воздерживается от воздаяния за грехи в жизни будущей. Он скрыл у человека, за его прекрасной внешностью то, что порицаемое взором, Он обещал тем, кто обращается к нему, искренне каясь о совершённом, заменить их грехи на благие деяния. Человек, познавший это имя Аллаха, скрывает у себя всё порочное и скверное и покрывает пороки других творений, обращаясь к ним с прощением и снисхождением',
  },
  {
    id: 16,
    name: 'القهار',
    transliteration: 'Аль-Каххар',
    translate: 'Покоритель',
    mention: '6:18; 12:39; 13:16; 14:48; 38:65; 39:4; 40:16',
    desc:
      'Он, который победоносный и господствующий, так как Он может все что пожелает. Господствующий, Чьему величию покорны творения, Уничтожающий в огромных масштабах. Тот, кто своим высочеством и могуществом укрощает творения. Тот, кто заставляет делать то, что хочет, независимо от того, желают этого или не желают творения. Тот, чьему величию покорны творения',
  },
  {
    id: 17,
    name: 'الوهاب',
    transliteration: 'Аль-Ваххаб',
    translate: 'Дарующий, Покрывающий',
    mention: '3:8; 38:9, 35',
    desc:
      'Он, который дарует все благословения своим созданиям. Тот, у Кого блага в изобилии. Тот, кто дарует бескорыстно, кто дарует блага рабам своим. Тот, кто, не дожидаясь просьбы, дарует необходимое',
  },
  {
    id: 18,
    name: 'الرزاق',
    transliteration: 'Ар-Раззак',
    translate: 'Обеспечивающий',
    mention: '10:31; 24:38; 32:17; 35:3; 51:58; 67:21',
    desc:
      'Он, который обеспечивает благо от всех вещей своим созданиям. Создающий блага и Наделяющий ими Свои создания. Бог — наделяющий средствами к существованию. Тот, кто сотворил средства к существованию и наделил ими свои создания. Он наделил их дарами как осязаемыми, так и такими как разум, знание и вера в сердце. Тот, кто сохраняет жизнь живых творений и налаживает её',
  },
  {
    id: 19,
    name: 'الفتاح',
    transliteration: 'Аль-Фаттах',
    translate: 'Открывающий (Разъясняющий)',
    mention: '7:96; 23:77; 34:26; 35:2; 48:1; 96:1-6',
    desc:
      'Он, который открывает разрешение всех проблем. Тот, Который раскрывает скрытое, облегчает трудности, отводит их. Он раскрывает сердца верующих для познания Его и любви к Нему, открывает нуждающимся врата для удовлетворения их потребностей',
  },
  {
    id: 20,
    name: 'العليم',
    transliteration: 'Аль-Алим',
    translate: 'Всезнающий',
    mention:
      '2:29, 95, 115, 158; 3:73, 92; 4:12, 17, 24, 26, 35, 147; 6:59; 8:17; 11:5; 12:83; 15:86; 22:59; 24:58, 59; 24:41; 33:40; 35:38; 57:6; 64:18',
    desc:
      'Он, который все знает. Тот, кто знает все обо всём. Тот, Которому известны и самые малые деяния, и утаённые мысли, и намерения, и мечты. Он не нуждается в дополнительной информации, напротив, всякое знание исходит от Него. От Него не скрыта ни малейшая частица. Он знает обо всём, что было, и о том, что произойдёт, и ведает о невозможном',
  },
  {
    id: 21,
    name: 'القابض',
    transliteration: 'Аль-Кабид',
    translate: 'Уменьшающий (Ограничивающий)',
    mention: '2:245; 64:16-17',
    desc:
      'Тот , Который по Своему справедливому порядку сужает (уменьшает) блага, кому хочет. Тот, кто удерживает души в своей власти, подчинив их смерти, владеет благодеяниями своих искренних рабов и принимает служения их, удерживает сердца грешников и лишает их возможности познать его из-за их непокорности и высокомерия. Человек, познавший это имя Аллаха, удерживает своё сердце, своё тело и окружающих от прегрешений, зла, плохих деяний и насилия, увещевая, предостерегая и устрашая их',
  },
  {
    id: 22,
    name: 'الباسط',
    transliteration: 'Аль-Баасит',
    translate: 'Расширяющий, Развивающий, Увеличивающий',
    mention: '2:245; 4:100; 17:30',
    desc:
      'Он, который развивает, Он Ниспосылающий щедрый удел. Тот, кто доставляет созданиям жизнь, одарив их тела душами, и доставляет щедрый удел как слабым, так и богатым',
  },
  {
    id: 23,
    name: 'الخافض',
    transliteration: 'Аль-Хафид',
    translate: 'Принижающий',
    mention: '2:171, 3:191-192, 56:1-3, 95:5',
    desc: 'Унижающий всех тех, кто нечестив, кто восстал против истины',
  },
  {
    id: 24,
    name: 'الرافع',
    transliteration: 'Ар-Рафи',
    translate: 'Возвышающий',
    mention: '6:83-86, 19:56-57, 56:1-3',
    desc:
      'Возвышающий уверовавших, которые заняты богослужением; удерживающий на высоте небо и облака',
  },
  {
    id: 25,
    name: 'المعز',
    transliteration: 'Аль-Му`изз',
    translate: 'Усиливающий (Возвеличивающий)',
    mention: '3:26, 8:26, 28:5',
    desc: 'Дающий силу, мощь, победу тому, кто хочет, возвышая его',
  },
  {
    id: 26,
    name: 'المذل',
    transliteration: 'Аль-Музилль',
    translate: 'Ослабляющий (Свергающий)',
    mention: '3:26; 9:2, 14-15; 8:18; 10:27; 27:37; 39:25-26; 46:20',
    desc: 'Принижающий того, кого хочет, лишив его силы, мощи и победы',
  },
  {
    id: 27,
    name: 'السميع',
    transliteration: 'Ас-Сами`а',
    translate: 'Всеслышащий',
    mention:
      '2:127, 137, 186, 224, 227, 256; 3:34-35, 38; 4:58, 134, 148; 5:76; 6:13, 115; 8:17; 10:65; 12:34; 14:39; 21:4; 26:220; 40:20, 56; 41:36; 49:1',
    desc:
      'Тот, Кто слышит и самое утаённое, самое тихое. Тот, Кто объемлет своим слухом даже самое мельчайшее',
  },
  {
    id: 28,
    name: 'البصير',
    transliteration: 'Аль-Басыр',
    translate: 'Всевидящий',
    mention:
      '2:110; 3:15, 163; 4:58, 134; 10:61; 17:1, 17, 30, 96; 22:61, 75; 31:28; 40:20; 41:40; 42:11, 27; 57:4; 58:1; 67:19',
    desc:
      'Тот, Кто видит открытое и скрытое, явное и тайное. Тот, Кто объемлет своим видением даже самое мельчайшее',
  },
  {
    id: 29,
    name: 'الحكم',
    transliteration: 'Аль-Хакам',
    translate: ' Высший Судья (Решающий), Правый',
    mention: '6:62, 114; 10:109; 11:45; 22:69; 95:8',
    desc:
      'Он, который судит и обеспечивает то, что должно произойти. Тот , Чьи решения совершенно справедливы и всегда имеют силу, Отделяющий хорошее от плохого. Говорит Посланник Аллаха: "Поистине Аллах аль-Хакам (судья), и ему принадлежит суд (или за ним решение)"',
  },
  {
    id: 30,
    name: 'العدل',
    transliteration: 'Аль-`Адль',
    translate: 'Справедливейший (Правосудный)',
    mention: '5:8, 42; 6:92, 115; 17:71; 34:26; 60:8',
    desc:
      'Тот, у Кого порядок, решения, дела справедливы. Тот, Кто сам не проявляет несправедливости и запретил это остальным. Тот, Кто чист от несправедливости в своих делах и решениях. Дающий каждому по заслугам. Тот, Кто является источником наивысшей справедливости. Со своими врагами Он обходится справедливо, а к своим праведным рабам Он милостив и милосерден',
  },
  {
    id: 31,
    name: 'اللطيف',
    transliteration: 'Ал-Латиф',
    translate: 'Проницательный (Понимающий)',
    mention:
      '3:164; 6:103; 12:100; 22:63; 28:4-5; 31:16; 33:34; 42:19; 52:26-28; 64:14; 67:14',
    desc:
      'Он, который знает мельчайшие стороны любой вещи – Он, кто создает вещи, которые не доступны пониманию людей самым благим образом. Добрый по отношению к своим рабам, милостивый по отношению к ним, облегчающий им жизнь, содержащий их, милующий их',
  },
]
