export default [
  {
    id: 1,
    name: 'الله',
    translate: 'Аллах, Бог, Единый Бог',
    transliteration: 'Алла́х',
    desc:
      'Тот, Кто обладает божественностью и Тот, кто имеет права на то, чтобы Ему поклонялись все. Он есть Бог, Который заслуживает покорность и смирение от нас. Все виды поклонения могут быть адресованы только Ему. Это самое великое имя Аллаха, указывающее на Его божественную сущность. Это имя объемлет все 99 прекрасных имен Аллаха, является особым именем высочайшей сущности Всевышнего. Этим именем не нарекают больше никого',
    mention: 'Имя "Аллах" упоминается в Священном Коране 2697 раз',
  },
  {
    id: 2,
    name: 'الرحمن',
    translate: 'Милостивый, Сострадательный',
    transliteration: 'Ар-Рахма́н',
    desc:
      'Обладающий широчайшей милостью и благами, Милостивый на этом свете ко всем Своим созданиям. Он, который дает благословения и успех всему сущему не делая различия. И к тем, кто достоин милости, и к тем, кто не достоин ее, то есть к верующим и неверующим, мусульманам и немусульманам. Этим именем также не нарекают больше никого',
    mention:
      '56 раз и наиболее часто в 19-й суре (1:3; 2:163; 6:133, 147; 13:30; 17:110; 18:58; 19:18, 19, 26, 44, 45, 58, 61, 69, 75, 78, 85, 87, 88, 91, 92, 93, 96; 20:5, 90, 108, 109; 21:26, 36, 42, 112; 25:26, 59, 60; 26:5; 59:22; и т. д.)',
  },
  {
    id: 3,
    name: 'الرحيم',
    translate: 'Милосердный',
    transliteration: 'Ар-Рахи́м',
    desc:
      'Проявляющий всегда милость, Обладающий бесконечной милостью. Он, который дает благословения и успех, особенно тем, кто использует эти дары так, как сказал Аллах. Проявляющий на том свете милость только к уверовавшим, покорным рабам. Это имя указывает на особую милость Господа к верующим. Он проявил к ним великую милость: во-первых, когда сотворил их; во-вторых, когда наставил на прямой путь и даровал веру; в-третьих, когда осчастливит их в последней жизни',
    mention:
      'Упоминается в Коране: 114 раз по отношению к Аллаху. Часто встречается вместе с именем Аль-Рахман (1:1, 3; 2:37, 54, 128, 160, 163; 3:31; 4:100; 5:3; 5:98; 9:104, 118; 10:107; 11:41; 12:53, 64, 98; 15:49; 19:61; 20:108; 21:83, 112; 26:9, 104, 122, 140, 159, 17, 191, 217; 27:30; 78:38; и т. д.)',
  },
  {
    id: 4,
    name: 'الملك',
    translate: 'Властелин, Царь',
    transliteration: 'Аль-Ма́лик',
    desc:
      'Здесь означает царя царей, абсолютного властелина, заботливо руководящего своими последователями. Властитель всего сущего, Владыка Дня Суда. Аллаh абсолютно не нуждается ни в одном из Своих творений, в то время как все они нуждаются в Нём и находятся в Его власти',
    mention:
      'Это имя встречается в Коране в трёх лингвистических формах: аль-Малик (встречается пять раз), аль-Маалик (встречается два раза, см. Малик Аль-Мульк) и аль-Малиик (встречается один раз). (20:114) (23:116) (59:23) (62:1) (114:2)',
  },
  {
    id: 5,
    name: 'القدوس',
    transliteration: 'Аль-Кудду́с',
    translate: 'Святой',
    mention: 'аль-Бакара 2:255; Фатир 35:41; аль-Хашр 59:23; аль-Джумуа',
    desc:
      'Он Аллах Чистый от недостатков, от виновности, от всего недостойного. Он, который свободен от заблуждения, свободен от беспомощности и какого-либо порока. Недоступный для интеллекта творений и Чистый от того, что может вообразить человек. Далекий от всех качеств, которые могут быть постигнуты чувствами человека либо представлены в нашем воображении и наших мыслях, а тем более, - Далекий от всех пороков и недостатков. Он превыше того, чтобы иметь подобных Себе, равных Себе или сходных с Собой',
  },
  {
    id: 6,
    name: 'السلام',
    transliteration: 'Ас-Саля́м',
    translate: 'Пречистый, Дарующий мир и благополучие',
    mention:
      'ан-Нахль 16:96,97; аль-Фуркан 25:75; Каф 50:31—35; аль-Хашр 59:23',
    desc:
      'Всё благополучие, которое получает раб и остальные творения, исходит от Него',
  },
  {
    id: 7,
    name: 'المؤمن',
    transliteration: 'Аль-Му`мин',
    translate:
      'Оберегающий, Дарующий безопасность, Дающий Веру, Проводник Веры, Гарантирующий защиту',
    mention:
      'ат-Тауба 9:25—27, 40; аль-Хиджр 15:45—48; аль-Ахкаф 46:26; аль-Хашр 59:23',
    desc:
      'Он, который вселяет веру в сердца своих слуг, поддерживая тех, кто ищет спасения в Нем. Он и дает им спокойствие, Верный договору со Своими рабами, Спасающий от мучений Своих верных рабов. Тот, от Кого исходят безопасность и спокойствие посредством указания Им на средства их достижения и преграждения Им путей страха и вреда. Только Он дарует безопасность, и спокойствие наступает только по Его милости. Он даровал нам органы чувств, являющиеся средствами для нашего благополучия, указал нам путь к нашему спасению, даровал лекарства для нашего исцеления, еду и питье для нашего существования. И уверовали мы в Него также по Его милости, ибо только Он хранит безопасность всех творений, и все они надеются на Его помощь и защиту.',
  },
  {
    id: 8,
    name: 'المهيمن',
    transliteration: 'Аль-Мухе́ймин',
    translate: 'Хранитель, Попечитель, Проводник, Спаситель',
    mention: 'аль-Хашр 59:23',
    desc:
      'Он, который охраняет и защищает все сущее. Тот, Кто оберегает, владеет, управляет и наблюдает за деяниями, жизнью и пропитанием каждого из всех Своих созданий - малых и больших, великих и ничтожных',
  },
  {
    id: 9,
    name: 'العزيز',
    transliteration: 'Аль-`Ази́з',
    translate: 'Могущественный, Всемогущий, Победитель',
    mention:
      '2:209, 220, 228, 240; 3:4, 6, 18, 62, 126; 4:56, 158, 165; 5:38, 118; 6:96; 9:40, 71; 11:66; 14:47; 16:60; 22:40, 74; 26:9, 104, 122, 140, 159, 175, 191; 27:78; 29:26, 42; 38:9, 66; 39:5; 48:7; 54:42; 57:1; 58:21; 59:1, 23-24',
    desc:
      'Тот, у Кого особое величие, Непобедимый, Сильнейший, Одерживающий победу над всеми. Величайший; существование сходное с его существованием абсолютно невозможно. Всевышний Аллах - Один, у Него нет сотоварищей, и нужда Его творений в Нем огромна. Ни один из нас не в состоянии обойтись без Него',
  },
  {
    id: 10,
    name: 'الجبار',
    transliteration: 'Аль-Джабба́р',
    translate: 'Подчиняющий, Непреодолимый',
    mention: 'Аль-Хашр 59:23, Аль-Калям 68:19,20, Аш-Шуара 26:33',
    desc:
      'Он Тот , воле Которого подчинены абсолютно все творения, Который может принудить, Он, который восстанавливает все испорченное, завершает все незавершенное и кто обладает возможностью силой заставить людей сделать все, что Он пожелает. Традиционно перевод этого имени с арабского связан с аспектом силы, наличием возможности подчинять. В английских переводах принято использовать термин The Despot, чтобы подчеркнуть мысль о том, что никто не может контролировать Бога, и напротив, Аллах имеет силу принуждения, в частности, принуждения следовать тем или иным путём. Так как следовать Аллаху является наилучшим выбором, подчеркивается благо для человека, связанное с этим качеством Бога. Второе толкование связано со словом jabbarah, которое обычно переводится как "слишком высоко, чтобы быть достигнутым". Отсюда выводится, что Аллах выше чем кто бы то ни был',
  },
  {
    id: 11,
    name: 'المتكبر',
    transliteration: 'Аль-Мутакаббир',
    translate: 'Величественный, Превосходящий',
    mention: '2:260; 7:143; 59:23',
    desc:
      'Он Всевышний, Превосходящий все творения; Единственный Обладатель Истинного Величия, Который показывает Свое величие в каждой вещи и во всех случаях. Превосходящий все творения; Тот, качества которого выше качеств творений, чист от качеств творений; единственный обладатель истинного величия; Тот, Кто находит все свои создания ничтожными по сравнению со своей сущностью, ибо гордости не достоин никто, кроме Него. Его гордость проявляется в том, что он не позволяет никому претендовать на сотворение и оспаривать его повеления, власть и волеизъявление. Он сокрушает всех, высокомерно относящихся к нему и его созданиям. Человек, познавший это имя Аллаха, не проявляет жестокости и высокомерия к созданиям Аллаха, ибо жестокость — это насилие и несправедливость, а высокомерие — это самовозвеличивание, презрение к другим и посягательство на их права. Жестокость не относится к качествам праведных рабов Аллаха. Они обязаны подчиняться и покоряться своему властителю',
  },
  {
    id: 12,
    name: 'الخالق',
    transliteration: 'Аль-Халик',
    translate: 'Творец',
    mention: '6:101-102; 13:16; 24:45; 39:62; 40:62; 41:21; 59:24',
    desc:
      'Тот, кто творит по-настоящему, без примера и прообраза и определяет судьбу для созданий; Тот, Кто создаёт, что хочет, из ничего; тот, Кто создал мастеров и их мастерство, квалификацию; Тот, Кто предопределил меру всех созданий ещё до их существования и наделил их качествами, необходимыми для существования',
  },
  {
    id: 13,
    name: 'البارئ',
    transliteration: 'Аль-Бари',
    translate: 'Развивающий, Совершенствующий, Создатель. (Строитель)',
    mention: '59:24',
    desc:
      'Тот, Кто по Своему могуществу сотворил всё сущее; Он — Творец, Который создал всё из небытия по Своему предопределению. Для этого Ему не надо прилагать каких-либо усилий; Он говорит чему-либо: «Будь!» и оно сбывается. Познавший это имя Всевышнего не поклоняется никому, кроме своего Создателя, обращается только к Нему, ищет помощи только у Него и просит то, в чём нуждается, только у Него',
  },
  {
    id: 14,
    name: 'المصور',
    transliteration: 'Аль-Мусаввир',
    translate: 'Формирующий (Скульптор), Созидающий',
    mention: '20:50, 25:2, 59:24, 64:3',
    desc:
      'Тот, Кто придаёт формы и образы творениям; Тот, Кто дал каждому творению свою неповторимую, отличную от других таких же творений форму, вид, рисунок',
  },
  {
    id: 15,
    name: 'الغفار',
    transliteration: 'Аль-Гаффар',
    translate: 'Прощающий',
    mention: '20:82, 38:66, 39:5, 40:42, 71:10',
    desc:
      'Он, который все прощает и является Единственным Прощающим. Он обещал простить грехи тем , кто обращается к Нему, искренне каясь о совершенном. Тот, кто является утаивающим прегрешения творений, прощающим и на этом и на том свете; Тот, кто делает явными прекрасные черты своих рабов и покрывает их недостатки. Он скрывает их в мирской жизни и воздерживается от воздаяния за грехи в жизни будущей. Он скрыл у человека, за его прекрасной внешностью то, что порицаемое взором, Он обещал тем, кто обращается к нему, искренне каясь о совершённом, заменить их грехи на благие деяния. Человек, познавший это имя Аллаха, скрывает у себя всё порочное и скверное и покрывает пороки других творений, обращаясь к ним с прощением и снисхождением',
  },
  {
    id: 16,
    name: 'القهار',
    transliteration: 'Аль-Каххар',
    translate: 'Покоритель',
    mention: '6:18; 12:39; 13:16; 14:48; 38:65; 39:4; 40:16',
    desc:
      'Он, который победоносный и господствующий, так как Он может все что пожелает. Господствующий, Чьему величию покорны творения, Уничтожающий в огромных масштабах. Тот, кто своим высочеством и могуществом укрощает творения. Тот, кто заставляет делать то, что хочет, независимо от того, желают этого или не желают творения. Тот, чьему величию покорны творения',
  },
  {
    id: 17,
    name: 'الوهاب',
    transliteration: 'Аль-Ваххаб',
    translate: 'Дарующий, Покрывающий',
    mention: '3:8; 38:9, 35',
    desc:
      'Он, который дарует все благословения своим созданиям. Тот, у Кого блага в изобилии. Тот, кто дарует бескорыстно, кто дарует блага рабам своим. Тот, кто, не дожидаясь просьбы, дарует необходимое',
  },
  {
    id: 18,
    name: 'الرزاق',
    transliteration: 'Ар-Раззак',
    translate: 'Обеспечивающий',
    mention: '10:31; 24:38; 32:17; 35:3; 51:58; 67:21',
    desc:
      'Он, который обеспечивает благо от всех вещей своим созданиям. Создающий блага и Наделяющий ими Свои создания. Бог — наделяющий средствами к существованию. Тот, кто сотворил средства к существованию и наделил ими свои создания. Он наделил их дарами как осязаемыми, так и такими как разум, знание и вера в сердце. Тот, кто сохраняет жизнь живых творений и налаживает её',
  },
  {
    id: 19,
    name: 'الفتاح',
    transliteration: 'Аль-Фаттах',
    translate: 'Открывающий (Разъясняющий)',
    mention: '7:96; 23:77; 34:26; 35:2; 48:1; 96:1-6',
    desc:
      'Он, который открывает разрешение всех проблем. Тот, Который раскрывает скрытое, облегчает трудности, отводит их. Он раскрывает сердца верующих для познания Его и любви к Нему, открывает нуждающимся врата для удовлетворения их потребностей',
  },
  {
    id: 20,
    name: 'العليم',
    transliteration: 'Аль-Алим',
    translate: 'Всезнающий',
    mention:
      '2:29, 95, 115, 158; 3:73, 92; 4:12, 17, 24, 26, 35, 147; 6:59; 8:17; 11:5; 12:83; 15:86; 22:59; 24:58, 59; 24:41; 33:40; 35:38; 57:6; 64:18',
    desc:
      'Он, который все знает. Тот, кто знает все обо всём. Тот, Которому известны и самые малые деяния, и утаённые мысли, и намерения, и мечты. Он не нуждается в дополнительной информации, напротив, всякое знание исходит от Него. От Него не скрыта ни малейшая частица. Он знает обо всём, что было, и о том, что произойдёт, и ведает о невозможном',
  },
  {
    id: 21,
    name: 'القابض',
    transliteration: 'Аль-Кабид',
    translate: 'Уменьшающий (Ограничивающий)',
    mention: '2:245; 64:16-17',
    desc:
      'Тот , Который по Своему справедливому порядку сужает (уменьшает) блага, кому хочет. Тот, кто удерживает души в своей власти, подчинив их смерти, владеет благодеяниями своих искренних рабов и принимает служения их, удерживает сердца грешников и лишает их возможности познать его из-за их непокорности и высокомерия. Человек, познавший это имя Аллаха, удерживает своё сердце, своё тело и окружающих от прегрешений, зла, плохих деяний и насилия, увещевая, предостерегая и устрашая их',
  },
  {
    id: 22,
    name: 'الباسط',
    transliteration: 'Аль-Баасит',
    translate: 'Расширяющий, Развивающий, Увеличивающий',
    mention: '2:245; 4:100; 17:30',
    desc:
      'Он, который развивает, Он Ниспосылающий щедрый удел. Тот, кто доставляет созданиям жизнь, одарив их тела душами, и доставляет щедрый удел как слабым, так и богатым',
  },
  {
    id: 23,
    name: 'الخافض',
    transliteration: 'Аль-Хафид',
    translate: 'Принижающий',
    mention: '2:171, 3:191-192, 56:1-3, 95:5',
    desc: 'Унижающий всех тех, кто нечестив, кто восстал против истины',
  },
  {
    id: 24,
    name: 'الرافع',
    transliteration: 'Ар-Рафи',
    translate: 'Возвышающий',
    mention: '6:83-86, 19:56-57, 56:1-3',
    desc:
      'Возвышающий уверовавших, которые заняты богослужением; удерживающий на высоте небо и облака',
  },
  {
    id: 25,
    name: 'المعز',
    transliteration: 'Аль-Му`изз',
    translate: 'Усиливающий (Возвеличивающий)',
    mention: '3:26, 8:26, 28:5',
    desc: 'Дающий силу, мощь, победу тому, кто хочет, возвышая его',
  },
  {
    id: 26,
    name: 'المذل',
    transliteration: 'Аль-Музилль',
    translate: 'Ослабляющий (Свергающий)',
    mention: '3:26; 9:2, 14-15; 8:18; 10:27; 27:37; 39:25-26; 46:20',
    desc: 'Принижающий того, кого хочет, лишив его силы, мощи и победы',
  },
  {
    id: 27,
    name: 'السميع',
    transliteration: 'Ас-Сами`а',
    translate: 'Всеслышащий',
    mention:
      '2:127, 137, 186, 224, 227, 256; 3:34-35, 38; 4:58, 134, 148; 5:76; 6:13, 115; 8:17; 10:65; 12:34; 14:39; 21:4; 26:220; 40:20, 56; 41:36; 49:1',
    desc:
      'Тот, Кто слышит и самое утаённое, самое тихое. Тот, Кто объемлет своим слухом даже самое мельчайшее',
  },
  {
    id: 28,
    name: 'البصير',
    transliteration: 'Аль-Басыр',
    translate: 'Всевидящий',
    mention:
      '2:110; 3:15, 163; 4:58, 134; 10:61; 17:1, 17, 30, 96; 22:61, 75; 31:28; 40:20; 41:40; 42:11, 27; 57:4; 58:1; 67:19',
    desc:
      'Тот, Кто видит открытое и скрытое, явное и тайное. Тот, Кто объемлет своим видением даже самое мельчайшее',
  },
  {
    id: 29,
    name: 'الحكم',
    transliteration: 'Аль-Хакам',
    translate: ' Высший Судья (Решающий), Правый',
    mention: '6:62, 114; 10:109; 11:45; 22:69; 95:8',
    desc:
      'Он, который судит и обеспечивает то, что должно произойти. Тот , Чьи решения совершенно справедливы и всегда имеют силу, Отделяющий хорошее от плохого. Говорит Посланник Аллаха: "Поистине Аллах аль-Хакам (судья), и ему принадлежит суд (или за ним решение)"',
  },
  {
    id: 30,
    name: 'العدل',
    transliteration: 'Аль-`Адль',
    translate: 'Справедливейший (Правосудный)',
    mention: '5:8, 42; 6:92, 115; 17:71; 34:26; 60:8',
    desc:
      'Тот, у Кого порядок, решения, дела справедливы. Тот, Кто сам не проявляет несправедливости и запретил это остальным. Тот, Кто чист от несправедливости в своих делах и решениях. Дающий каждому по заслугам. Тот, Кто является источником наивысшей справедливости. Со своими врагами Он обходится справедливо, а к своим праведным рабам Он милостив и милосерден',
  },
  {
    id: 31,
    name: 'اللطيف',
    transliteration: 'Ал-Латиф',
    translate: 'Проницательный (Понимающий)',
    mention:
      '3:164; 6:103; 12:100; 22:63; 28:4-5; 31:16; 33:34; 42:19; 52:26-28; 64:14; 67:14',
    desc:
      'Он, который знает мельчайшие стороны любой вещи – Он, кто создает вещи, которые не доступны пониманию людей самым благим образом. Добрый по отношению к своим рабам, милостивый по отношению к ним, облегчающий им жизнь, содержащий их, милующий их',
  },
  {
    id: '32',
    name: 'الخبير',
    transliteration: 'Аль-Хабир',
    translate: 'Сведущий (Разбирающийся)',
    mention:
      '3:180; 6:18, 103; 17:30; 22:63; 25:58-59; 31:34; 34:1; 35:14; 49:13; 59:18; 63:11',
    desc:
      'Знающий тайное так же, как и явное, Знающий как внешнее проявление, так и внутреннее содержание; Тот, для Которого не существует тайного; Тот, от Чьих знаний ничто не уходит, не отдаляется; Тот, Кто знает то, что было, и то, что будет.',
  },
  {
    id: '33',
    name: 'الحليم',
    transliteration: 'Аль-Халим',
    translate: 'Сдержанный, Спокойный',
    mention:
      '2:225, 235, 263; 3:155; 4:12; 5:101; 17:44; 22:59; 33:51; 35:41; 64:17',
    desc:
      'Тот, кто освобождает от мучений, проявивших ослушание; Тот, Кто даёт блага как проявившим покорность, так и ослушавшимся; Тот, Кто видит ослушание своих повелений, однако Им не овладевает гнев, и Он не спешит с возмездием, несмотря на всё своё могущество. Человек, познавший это имя Аллаха, мягок и кроток в общении, не гневается и не поступает легкомысленно.',
  },
  {
    id: '34',
    name: 'العظيم',
    transliteration: "Аль-'Азым",
    translate: 'Величайший',
    mention: '2:105, 255; 42:4; 56:96',
    desc:
      'Величию которого нет начала и нет конца; высоте которого нет границ; тот, которому нет подобного; тот, чью подлинную сущность и величие, которые превыше всякой вещи, не в силах постичь никто, ибо это превыше возможностей разума творений.',
  },
  {
    id: '35',
    name: 'الغفور',
    transliteration: 'Аль-Гафур',
    translate: 'Всепрощающий (Исповедитель грехов)',
    mention:
      '22:173, 182, 192, 218, 225—226, 235; 3:31, 89, 129, 155; 4:25; 6:145; 8:69; 16:110, 119; 35:28; 40:3; 41:32; 42:23; 57:28; 60:7',
    desc: 'Тот, кто прощает грехи своим рабам. если они покаются.',
  },
  {
    id: '36',
    name: 'الشكور',
    transliteration: 'Аш-Шакур',
    translate: 'Благодарный (Вознаграждающий)',
    mention: '4:40; 14:7; 35:30, 34; 42:23; 64:17',
    desc:
      'Воздающий большую награду рабам своим за их малое богослужение, доводящий до совершенства слабые деяния, прощающий их.',
  },
  {
    id: '37',
    name: 'العلي',
    transliteration: "Аль-'Алий",
    translate: 'Всевышний',
    mention:
      '2:255; 4:34; 22:62; 31:30; 34:23; 40:12; 41:12; 42:4, 51; 48:7; 57:25; 58:21; 87:1',
    desc:
      'Тот, высочество Которого неоценимо высокое; Тот, у Кого нет равных, нет соперников, нет сотоварищей и сотоварищей; Тот, Кто выше всего этого; Тот, Чьи сущность, мощь и сила наивысочайшие.',
  },
  {
    id: '38',
    name: 'الكبير',
    transliteration: 'Аль-Кабир',
    translate: 'Великий',
    mention: '4:34; 13:9; 22:62; 31:30; 34:23; 40:12',
    desc:
      'Тот, у которого в качествах и делах наличествует истинное величие; не нуждающийся ни в чём; Тот, Которого никто и ничто не может ослабить; Тот, с которым нет сходных.',
  },
  {
    id: '39',
    name: 'الحفيظ',
    transliteration: 'Аль-Хафиз',
    translate: 'Хранитель',
    mention: '11:57; 12:55; 34:21; 42:6',
    desc:
      'Охраняющий всё сущее, каждое сущее, включая наимельчайшие субстанции; Тот, Чьё покровительство нескончаемо, бесконечно; Тот, Кто охраняет и содержит всякое сущее.',
  },
  {
    id: '40',
    name: 'المقيت',
    transliteration: 'Аль-Мукыт',
    translate: 'Поддерживающий (Обеспечивающий)',
    mention: '4:85',
    desc:
      'Распоряжающийся всем необходимым для жизнеобеспечения; Доводящий это до Своих созданий, Определяющий его количество; Дающий помощь; Могущественный.',
  },
  {
    id: '41',
    name: 'الحسيب',
    transliteration: 'Аль-Хасиб',
    translate: 'Достаточный (Расчетчик)',
    mention: '4:6, 86; 6:62; 33:39',
    desc:
      'Достаточный для рабов своих; достаточный всякому, кто на Него уповает. Он насыщает рабов своих по своей милости, отводит их от беды. Он достаточен, чтобы в достижении благ и пропитания уповать только на Него, и нет необходимости в ком-либо ином. В Нём нуждаются все Его создания, ибо Его достаточность вечна и совершенна.',
  },
  {
    id: '42',
    name: 'الجليل',
    transliteration: 'Аль-Джалиль',
    translate: 'Величественный',
    mention: '7:143; 39:14; 55:27',
    desc:
      'Тот, у Кого истинное величие и все совершенные качества; чистый от всяких недостатков.',
  },
  {
    id: '43',
    name: 'الكريم',
    transliteration: 'Аль-Карим',
    translate: 'Щедрейший (Великодушный)',
    mention: '23:116; 27:40; 76:3; 82:6-8; 96:1-8',
    desc:
      'Тот, у кого не уменьшаются блага, сколько бы ни дал; ценнейший, охватывающий всё ценное; Тот, у Кого каждое деяние достойно высочайшей похвалы; Тот, Кто исполняет свои обещания и одаряет не только сполна, но и добавляет из своей милости даже тогда, когда исчерпываются все желания созданий. Его не беспокоит то, кого и чем Он одарил, и Он не губит тех, кто укрылся у Него, ибо щедрость Аллаха абсолютна и совершенна.',
  },
  {
    id: '44',
    name: 'الرقيب',
    transliteration: 'Ар-Ракыб',
    translate: 'Наблюдающий (Присматривающий)',
    mention: '4:1; 5:117; 33:52',
    desc:
      'Следящий за состоянием своих созданий, знающий все их деяния, фиксирующий все их деяния; Тот, от контроля Которого никто и ничто не уходит.',
  },
  {
    id: '45',
    name: 'المجيب',
    transliteration: 'Аль-Муджиб',
    translate: 'Отзывчивый',
    mention: '2:186; 7:194; 11:61',
    desc:
      'Отзывающийся на молитвы и просьбы. Он облагодетельствует своего раба ещё до того, как он к нему обратится, отвечает на его мольбу ещё до того, как его постигнет нужда.',
  },
  {
    id: '46',
    name: 'الواسع',
    transliteration: 'Аль-Вааси',
    translate: 'Всеобъемлющий (Вездесущий)',
    mention: '2:115, 247, 261, 268; 3:73; 4:130; 5:54; 24:32; 63:7',
    desc:
      'Тот, блага Которого широки для созданий; Тот, милость Которого велика для всякого сущего.',
  },
  {
    id: '47',
    name: 'الحكيم',
    transliteration: 'Аль-Хаким',
    translate: 'Мудрейший',
    mention:
      '2:32, 129, 209, 220, 228, 240, 260; 3:62, 126; 4:17, 24, 26, 130, 165, 170; 5:38, 118; 9:71; 15:25; 31:27; 46:2; 51:30; 57:1; 59:22-24; 61:1; 62:1, 3; 66:2',
    desc:
      'Тот, Кто всё делает мудро; Тот, у Кого дела правильные; Тот, Кто знает суть, внутреннее содержание всех дел; Тот, Кто хорошо знает мудрое решение, предопределённое им самим; Тот, у Кого все дела, все решения, справедливые, мудрые.',
  },
  {
    id: '48',
    name: 'الودود',
    transliteration: 'Аль-Вадуд',
    translate: 'Любящий Свои творения',
    mention: '11:90; 85:14',
    desc:
      'Любящий своих рабов и любимый для сердец «аулия» («аулия» — мн. ч. от «вали» — праведный, преданый слуга).',
  },
  {
    id: '49',
    name: 'المجيد',
    transliteration: 'Аль-Маджииду',
    translate: 'Славный',
    mention: '11:73; 72:3',
    desc:
      'Наивысочайший по величию; тот, у кого добра много, кто даёт щедро, от кого польза великая.',
  },
  {
    id: '50',
    name: 'الباعث',
    transliteration: "Аль-Ба'ис",
    translate: 'Воскрешающий (Пробуждающий)',
    mention: '2:28; 22:7; 30:50; 79:10-11',
    desc:
      'Воскрешающий создания в День Суда; тот, кто посылает к людям пророков, отправляет помощь рабам своим.',
  },
  {
    id: '51',
    name: 'الشهيد',
    transliteration: 'Аш-Шахид',
    translate: 'Свидетель (Свидетельствующий)',
    mention:
      '4:33, 79, 166; 5:117; 6:19; 10:46, 61; 13:43; 17:96; 22:17; 29:52; 33:55; 34:47; 41:53; 46:8; 48:28; 58:6-7; 85:9',
    desc:
      'Зорко и бдительно следящий за миром. Слово «шахид» родственно понятию «шахада» — свидетельство. Он — Свидетель происходящего, от Которого не может утаиться ни одно событие, сколь малым и ничтожным бы оно ни было. Свидетельствовать — означает не является тем, о чём свидетельствуешь.',
  },
  {
    id: '52',
    name: 'الحق',
    transliteration: 'Аль-Хакк',
    translate: 'Истина (Настоящий)',
    mention: '6:62; 18:44; 20:114; 22:6, 62; 23:116; 24:25; 31:30',
    desc:
      'Устанавливающий истинность истинного через свои слова (калима); Тот, Кто устанавливает истинность своих друзей.',
  },
  {
    id: '53',
    name: 'الوكيل',
    transliteration: 'Аль-Вакиль',
    translate: 'Доверенный',
    mention:
      '3:173; 4:81; 4:171; 6:102; 9:51; 17:65; 28:28; 31:22; 33:3, 48; 39:62; 73:9',
    desc:
      'Тот, на Кого следует полагаться; достаточный для полагающихся только на Него; Кто радует надеющихся и полагающихся только на Него.',
  },
  {
    id: '54',
    name: 'القوى',
    transliteration: 'Аль-Кавий',
    translate: 'Всесильный',
    mention: '2:165; 8:52; 11:66; 22:40, 74; 33:25; 40:22; 42:19; 57:25; 58:21',
    desc:
      'Обладатель полной, совершенной мощи, побеждающий; Тот, Который не проигрывает; Тот, у Кого сила выше всякой другой силы.',
  },
  {
    id: '55',
    name: 'المتين',
    transliteration: 'Аль-Матин',
    translate: 'Непоколебимый',
    mention: '22:74; 39:67; 51:58; 69:13-16',
    desc:
      'Не нуждающийся в средствах для осуществления своих решений; не нуждающийся в помощи; Тот, Кому не нужен помощник, сотоварищ.',
  },
  {
    id: '56',
    name: 'الولى',
    transliteration: 'Аль-Валий',
    translate: 'Друг (Сподвижник)',
    mention: '2:107, 257; 3:68, 122; 4:45; 7:155, 196; 12:101; 42:9, 28; 45:19',
    desc:
      'Тот, Кто благоприятствует подчинившимся, помогающий тем, кто любит их; укрощающий врагов; поручающийся за деяния созданий; охраняющий созданных.',
  },
  {
    id: '57',
    name: 'الحميد',
    transliteration: 'Аль-Хамид',
    translate: 'Достохвальный',
    mention:
      '4:131; 14:1, 8; 17:44; 11:73; 22:64; 31:12, 26; 34:6; 35:15; 41:42 42:28; 57:24; 60:6; 64:6; 85:8',
    desc:
      'Достойный всех похвал по причине своего совершенства; обладатель вечной славы.',
  },
  {
    id: '58',
    name: 'المحصى',
    transliteration: 'Аль-Мухси',
    translate: 'Счетовод (Учитывающий)',
    mention: '19:94; 58:6; 67:14',
    desc:
      'Тот, Кто своими знаниями определяет границы для всего сущего; Тот, от Кого ничего не ускользает.',
  },
  {
    id: '59',
    name: 'المبدئ',
    transliteration: 'Аль-Мубди',
    translate: 'Начинаючий (Основатель)',
    mention: '10:4, 34; 27:64; 29:19; 85:13',
    desc:
      'Тот, Кто с самого начала, без примера и прообраза сотворил всё сущее.',
  },
  {
    id: '60',
    name: 'المعيد',
    transliteration: "Аль-Му'иид",
    translate: 'Возвращающий (Восстанавливающий)',
    mention: '10:4, 34; 27:64; 29:19; 85:13',
    desc:
      'Повторяющий, придающий вселенной устойчивость, возвращающий; тот, кто возвращает всё живое в мёртвое состояние, а затем на том свете оживляет их, возвращая к жизни.',
  },
  {
    id: '61',
    name: 'المحيى',
    transliteration: 'Аль-Мухйи',
    translate: 'Оживляющий (Животворящий)',
    mention:
      '2:28; 3:156; 7:158; 10:56; 15:23; 23:80; 30:50; 36:78-79; 41:39; 57:2',
    desc:
      'Тот, Кто творит жизнь; Тот, Кто даёт жизнь любой вещи, которой хочет; Тот, Кто создал творения из ничего; Тот, Кто оживит и после смерти.',
  },
  {
    id: '62',
    name: 'المميت',
    transliteration: 'Аль-Мумит',
    translate: 'Умерщвляющий (Усыпляющий)',
    mention: '3:156; 7:158; 15:23; 57:2',
    desc:
      'Тот, Кто предписал смерть всем смертным; Тот, кроме Которого нет умерщвляющего; Тот, Кто укрощает рабов своих смертью когда хочет и как хочет.',
  },
  {
    id: '63',
    name: 'الحي',
    transliteration: 'Аль-Хаий',
    translate: 'Живущий (Бодрствующий)',
    mention: '2:255; 3:2; 20:58, 111; 25:58; 40:65',
    desc:
      'Вечно живой; Тот, жизни которого нет начала и нет конца; Тот, Кто всегда был живым и останется навечно живым; живой, не умирающий.',
  },
  {
    id: '64',
    name: 'القيوم',
    transliteration: 'Аль-Кайум',
    translate: 'Самостоятельный (Независимый)',
    mention: '2:255; 3:2; 20:111; 35:4',
    desc:
      'Независимый ни от кого и ни от чего, не нуждающийся ни в ком и ни в чём; Тот, Кто заботится обо всём; благодаря которому существует всё сущее; Тот, Кто сотворил творения и содержит их; Тот, Кто владеет знанием обо всём.',
  },
  {
    id: '65',
    name: 'الواجد',
    transliteration: 'Аль-Ваджид',
    translate: 'Богатый (Находящийся)',
    mention: '38:44',
    desc:
      'Тот, у Которого всё сущее, для Которого отсутствует понятие «недостающее», «недостаточность»; Тот, у Которого сохраняются все дела, не пропадает ничего; Тот, Кто разумеет всё.',
  },
  {
    id: '66',
    name: 'الماجد',
    transliteration: 'Аль-Маджид',
    translate: 'Наиславнейший',
    mention: '11:73; 85:15',
    desc:
      'Тот, у Кого полное совершенство; Тот, у Кого прекрасное величие; Тот, у Кого качества и дела велики и совершенны; проявляющий щедрость и милость по отношению к своим рабам.',
  },
  {
    id: '67',
    name: 'الواحد الاحد',
    transliteration: 'Аль-Вахид уль-Ахад',
    translate: 'Один Единственный (Единый)',
    mention:
      '2:133, 163, 258; 4:171; 5:73; 6:19; 9:31; 12:39; 13:16; 14:48; 18:110; 22:73; 37:4; 38:65; 39:4; 40:16; 41:6; 112:1',
    desc: 'Нет никого кроме Него и никого равного Ему.',
  },
  {
    id: '68',
    name: 'الصمد',
    transliteration: 'Ас-Самад',
    translate: 'Самодостаточный (Неизменный)',
    mention: '6:64; 27:62; 112:2',
    desc:
      'Символизирует вечность и независимость Аллаха. Он Тот, Которому все подчиняются; Тот, без Чьего ведома не происходит ничего; Тот, в ком нуждаются все во всём, а сам Он не нуждается ни в ком и ни в чём.',
  },
  {
    id: '69',
    name: 'القادر',
    transliteration: 'Аль-Кадир',
    translate: 'Обладатель мощи',
    mention: '6:65; 17:99; 35:44; 36:81; 41:39; 46:33; 70:40-41; 75:40; 86:8',
    desc:
      'Тот, Кто может сотворить из ничего и может уничтожить сущее; Тот, Кто может создать бытие из небытия и может превратить в небытиё; делающий всё мудро.',
  },
  {
    id: '70',
    name: 'المقتدر',
    transliteration: 'Аль-Муктадир',
    translate: 'Всемогущий',
    mention: '18:45-46; 28:38-40; 29:39-40; 43:42, 51; 54:42, 55',
    desc:
      'Тот, Кто устраивает дела для созданий наилучшим образом, так как никто этого не может.',
  },
  {
    id: '71',
    name: 'المقدم',
    transliteration: 'Аль-Мукаддим',
    translate: 'Приближающий (Продвигающий)',
    mention: '16:61; 17:34; 50:28',
    desc:
      'Выдвигающий вперёд всё то, что должно быть впереди; выдвигающий вперёд достойных рабов своих.',
  },
  {
    id: '72',
    name: 'المؤخر',
    transliteration: 'Аль-Муаххыр',
    translate: 'Отдаляющий (Отодвигающий)',
    mention: '7:34; 11:8; 14:42; 16:61; 71:4',
    desc:
      'Отодвигающий назад всё то, что должно быть позади; тот, кто отодвигает назад по своему разумению и по своей воле неверных, нечестивцев и всех тех, кто должен быть отодвинут назад.',
  },
  {
    id: '73',
    name: 'الأول',
    transliteration: 'Аль-Ауваль',
    translate: 'Первоначальный',
    mention: '57:3',
    desc:
      'Первый, Безначальный и Предвечный. Тот, Кто предшествовал вселенной. (Альфа)',
  },
  {
    id: '74',
    name: 'الأخر',
    transliteration: 'Аль-Ахыр',
    translate: 'Завершающий (Последний)',
    mention: '39:68; 55:26-27; 57:3',
    desc:
      'Тот, Кто останется после уничтожения всего сотворённого; Тот, Кому нет конца, вечно остающийся; Тот, Кто уничтожает всё; Тот, после Которого не будет ничего, кроме Него, Вечного Бессмертного Всемогущего Бога, Творца всех времён, народов и миров. (Омега)',
  },
  {
    id: '75',
    name: 'الظاهر',
    transliteration: 'Аз-Заахир',
    translate: 'Явный (Понятный)',
    mention: '3:191; 6:95-97; 50:6-11; 57:3; 67:19',
    desc:
      'Имманентный. Проявляющийся во множестве фактов, свидетельствующих о Его существовании.',
  },
  {
    id: '76',
    name: 'الباطن',
    transliteration: 'Аль-Баатын',
    translate: 'Сокровенный (Тайный)',
    mention: '6:103; 57:3',
    desc:
      'Тот, Кто знает как явное, так и скрытое обо всём; Тот, Чьи признаки явственны, а Сам на этом свете невидим.',
  },
  {
    id: '77',
    name: 'الوالي',
    transliteration: 'Аль-Ваали',
    translate: 'Правитель (Покровитель)',
    mention: '13:11; 42:9',
    desc:
      'Властвующий над всем сущим; Тот, Кто осуществляет всё по своему желанию и мудрости; Тот, Чьи решения осуществляются везде и всегда.',
  },
  {
    id: '78',
    name: 'المتعالي',
    transliteration: "Аль-Мута'али",
    translate: 'Превознесенный (Трансцендентный)',
    mention: '7:190; 13:9; 20:114; 22:73-74; 27:63; 30:40; 54:49-53',
    desc:
      'Тот, Кто выше клеветнических измышлений, выше сомнений, возникающих у созданных.',
  },
  {
    id: '79',
    name: 'البر',
    transliteration: 'Аль-Барр',
    translate: 'Добродетельный',
    mention: '16:4-18; 52:28',
    desc:
      'Тот, Кто делает добро для рабов своих, милостив для них; дающий тем, кто просит, проявляя милость к ним; верный договору, обещанию для созданных.',
  },
  {
    id: '80',
    name: 'التواب',
    transliteration: 'Ат-Тавваб',
    translate: 'Принимающий (Приемлющий покаяние)',
    mention:
      '2:37, 54, 128, 160; 4: 17-18, 64; 9:104, 118; 10:90-91; 24:10; 39:53; 40:3; 49:12; 110:3',
    desc:
      'От арабского «тауба» — покаяние. Принимающий покаяние слуг, благоприятствующий им в покаянии, приводящий их к покаянию, способный усовестить, побудить к покаянию. Отвечающий на мольбы; прощающий грехи покаявшихся.',
  },
  {
    id: '81',
    name: 'المنتقم',
    transliteration: 'Аль-Мунтакым',
    translate: 'Карающий (Отмщающий)',
    mention: '32:22; 43:41, 55; 40:10; 44:16; 75:34-36',
    desc:
      'Ломающий хребет ослушавшимся; мучающий нечестивцев, но только после оповещения и предупреждения, если не опомнились.',
  },
  {
    id: '82',
    name: 'العفو',
    transliteration: "Аль-'Афувв",
    translate: 'Снисходительный (Избавляющий от грехов)',
    mention: '4:17, 43, 99, 149; 16:61; 22:60; 58:2',
    desc:
      'Тот, Кто извиняет за прегрешения и стирает их; очищает плохие деяния; Тот, Чья милость широка; делающий добро и непослушным, не спеша с наказанием.',
  },
  {
    id: '83',
    name: 'الرؤوف',
    transliteration: 'Ар-Рауф',
    translate: 'Мягкий, Сострадательный',
    mention: '2:143, 207; 3:30; 9:117; 16:7, 47; 22:65; 24:20; 57:9; 59:10',
    desc:
      'Лишённый грубости, проявляющий сострадание и жалость ко всем созданиям в этой жизни и к некоторым из них в вечной жизни из числа приближенных Ему верующих.',
  },
  {
    id: '84',
    name: 'مالك الملك',
    transliteration: 'Малик уль-Мульк',
    translate: 'Царь Царей',
    mention: '14:8; 3:26',
    desc:
      'Царь царств; всевластный царь сущего царства; тот, кто делает то, что хочет; нет никого, кто бы мог игнорировать, отвести его решения; нет никого, кто мог бы не одобрять, критиковать, ставить под сомнение его решение.',
  },
  {
    id: '85',
    name: 'ذو الجلال والإكرام',
    transliteration: 'Зуль-Джаляли валь-Икрам',
    translate: 'Обладатель Величия и Радушия',
    mention: '33:34-35; 55:27, 78; 76:13-22',
    desc:
      'Обладатель особого величия и щедрости; обладатель совершенства; всё величие принадлежит Ему, и все щедроты исходят от Него.',
  },
  {
    id: '86',
    name: 'المقسط',
    transliteration: 'Аль-Муксит',
    translate: 'Справедливый',
    mention: '3:18; 7:29',
    desc:
      'Тот, у Кого все решения мудры и справедливы; мстящий притеснителям за притеснённых; устанавливающий совершенный порядок, радующий притеснителя после того, как обрадовал притеснённого и тот простил.',
  },
  {
    id: '87',
    name: 'الجامع',
    transliteration: "Аль-Джами'а",
    translate: 'Объединяющий (Собирающий)',
    mention: '2:148; 3:9; 4:140',
    desc:
      'Тот, Кто собрал все совершенства сущности, качеств и дел; Тот, Кто собирает все творения; Тот, Кто собирает на том свете в местности Арасат.',
  },
  {
    id: '88',
    name: 'الغني',
    transliteration: 'Аль-Ганий',
    translate: 'Самодостаточный (Обеспеченный богатством)',
    mention:
      '2:263; 3:97; 4:131; 6:133; 10:68; 14:8; 22:64; 27:40; 29:6; 31:12, 26; 35:15, 44; 39:7; 47:38; 57:24; 60:6; 64:6',
    desc: 'Богатый и не нуждающийся ни в чём; Тот, в Ком нуждаются все.',
  },
  {
    id: '89',
    name: 'المغني',
    transliteration: 'Аль-Мугни',
    translate: 'Обогащающий',
    mention: '9:28; 23:55-56; 53:48; 76:11-22',
    desc:
      'Дающий блага слугам; Тот, Кто обогащает, кого хочет; достаточный для созданных.',
  },
  {
    id: '90',
    name: 'المانع',
    transliteration: 'Аль-Мани',
    translate: 'Ограждающий (Предотвращающий)',
    mention: '67:21; 28:35; 33:9',
    desc:
      'Тот, Кто не даёт тому, кому не хочет дать, чтобы испытать его или чтобы удержать, защитить его от плохого.',
  },
  {
    id: '91',
    name: 'الضار',
    transliteration: 'Ад-Дарр',
    translate: 'Сокрушитель (Способный послать беду)',
    mention: '6:17; 36:23; 39:38',
    desc:
      'Стирающий царства и народы с лица земли, насылающий эпидемии и стихийные бедствия на грешников, испытывающий творения.',
  },
  {
    id: '92',
    name: 'النافع',
    transliteration: "Ан-Нафи'а",
    translate: 'Благотворитель',
    mention: '30:37',
    desc:
      'Приносящий пользу тому, кому хочет, исходя из Собственных решений; Тот, без Чьего ведома никто не в состоянии принести пользу.',
  },
  {
    id: '93',
    name: 'النور',
    transliteration: 'Ан-Нур',
    translate: 'Просветляющий (Свет)',
    mention:
      '2:257; 5:15-16; 6:122; 24:35-36, 40; 33:43, 45-46; 39:22, 69; 57:9, 12-13, 19, 28',
    desc:
      'Тот, Кто является светом небес и земли; Тот, Кто освещает творениям истинный путь; показывает свет истинного пути.',
  },
  {
    id: '94',
    name: 'الهادي',
    transliteration: 'Аль-Хади',
    translate: 'Ведущий (Направляющий)',
    mention: '2:4-7; 20:50; 25:31, 52; 28:56; 87:3',
    desc:
      'Ведущий верным путём; Тот, Кто истинными высказываниями наставляет созданных на истинный путь; Тот, Кто оповещает созданных об истинном пути; Тот, Кто подводит сердца к познанию себя; Тот, Кто подводит тела созданных к богослужению.',
  },
  {
    id: '95',
    name: 'البديع',
    transliteration: "Аль-Бади'a",
    translate: 'Творец (Изобретатель)',
    mention: '2:117; 6:101; 7:29',
    desc:
      'Тот, для Которого нет равных, Которому нет подобных ни в сущности, ни в качествах, ни в повелениях, ни в решениях; Тот, Кто творит всё без примера и прообраза.',
  },
  {
    id: '96',
    name: 'الباقي',
    transliteration: 'Аль-Бааки',
    translate: 'Вечный (Абсолютное бытие)',
    mention: '6:101; 55:26-28; 28:60, 88',
    desc:
      'Остающийся навечно; Тот единственный, Кто остаётся навечно; Тот, существование Которого вечно; Тот, Кто не исчезает; Тот, Кто остаётся бесконечно, навсегда.',
  },
  {
    id: '97',
    name: 'الوارث',
    transliteration: 'Аль-Варис',
    translate: 'Наследник',
    mention: '15:23; 21:89; 28:58',
    desc:
      'Наследник всего сущего; тот, Кто остаётся навечно, Которому остаётся наследство всех Его творений; Тот, у Кого остаётся вся власть после исчезновения Его творений; Тот, Кто наследует мир и всё сущее в нём.',
  },
  {
    id: '98',
    name: 'الرشيد',
    transliteration: 'Ар-Рашид',
    translate: 'Правильный (Разумный)',
    mention: '2:256; 11:87',
    desc:
      'Направляющий на правильный путь; Тот, Кто даёт счастье тому, кому хочет, направляя его на истинный путь; Тот, Кто отдаляет того, кого хочет, по установленному им порядку.',
  },
  {
    id: '99',
    name: 'الصبور',
    transliteration: 'Ас-Сабур',
    translate: 'Терпеливейший',
    mention: '2:153, 3:200, 103:3; 8:46',
    desc:
      'Тот, у Кого велики кротость и терпение; Тот, Кто не спешит мстить ослушавшимся; Тот, Кто отсрочивает наказание; Тот, Кто не делает ничего раньше срока; Тот, Кто делает всё в своё время.',
  },
]
